const tips = [
	"世界分三界：天、人、地。",
    "天界收纳飞升成仙之人。",
    "人界中人魔共存，人类居住地外是魔域，人类居住地内凡人多居住于平原，修仙者多居住在与魔域相接、高入云天的太虚山脉。",
    "地界收纳鬼魂、负责投胎之事。",
    "人有三魂，天魂、地魂、人魂；动物牲畜有二魂，天魂、地魂；草木有一魂，地魂。",
	"修仙者有灵根，境界：练气、筑基、金丹、元婴、化神、炼虚、合体、大乘、渡劫，最后飞升。",
	"修仙者中有魔修正道，修仙者入魔灵根化为煞气，丹田亦颠倒混乱，故魔修走火入魔身死的情况频繁。",
	"万年前，上神帝俊为太虚山脉设下隔绝魔域的结界，允许人类自由进出魔域，魔物无法进入太虚山脉，结界初现，万物昌荣，世间迎来鼎盛，史称平泰百纪。",
	"凡人若想凭一己之力登上太虚山脉，同登天无异。",
	"因凡人妄图登太虚而身死的情况频繁，亦有弟子走火入魔进入凡界屠杀，各大宗门协力于太虚山脉下设立混天门。",
	"若想进入凡界，需持宗门内发行的行天印通过混天门。",
	"行天印为持有者设下禁制，禁止持有者于凡界攻击无灵根者，一旦感应会强制送回混天门内。",
    "行天印同样在持有者濒死时刻强制送回混天门内。",
    "亦流传着一个无需通行令进入凡界的方法：如若有缘，混天门的守山人处可寻得通融。",
    "至今为止关于守山人放行的条件，甚至守山人是何人，各方都说法不一。",
	"人于慰天祭上供奉上苍，祈求安康。",
    "凡人界中慰天祭由尘缘堂举办，太虚山脉中由明道门举办，二祭坛对称阴阳两仪。",
    "通常凡人界中每家每户也会各自祭拜，亦有门派中的单独祭拜。",
	"慰天祭前，牲畜和魔兽格外躁动，故慰天祭常以魔物牲畜为祭品，尘缘堂与明道门的记载中未曾记载有使用人祭的慰天祭。",
    "但也有传闻说正是曾有活人祭祀，上苍降下天罚使百兽悲恸、万物凋零，这才需慰天以弥补前人之错，所谓因果报应。",
   "慰天祭时，有时会发生人幸得上天垂帘飞升之事。"
];

const createHeader = () => {
	if ($('#header').length === 0) {
	  $('#story').append(`<div id="header">
		<h1>偏门左道</h1>`);
	  $('#header').append(`<div class="map-mini">`);
	  $('#header').append('</div>');
	  $('#story').append('</div>');;
	} else {
		$('.tip').text(randomTip);
	}
};

const updateHeader = () => {
	let randomTip = tips[Math.floor(Math.random() * tips.length)];
	$(document).one(':passagestart', (event) => {
		if ($('.tip').length !== 0) {
			$('#header').append('<span class="tip">${randomTip}</span>');
		}
	});
};